# Core CLI tools
brew "automake"
brew "bison"
brew "chruby"
brew "composer"
brew "fzf"
brew "gdbm"
brew "gh"
brew "imagemagick"
brew "lftp"
brew "libffi"
brew "libyaml"
brew "mysql"
brew "node"
brew "nvm"
brew "pkg-config"
brew "ruby-install"
brew "yarn"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Core apps
cask "1password"
cask "alfred"
cask "appcleaner"
cask "google-chrome"
cask "hiddenbar"
cask "imageoptim"
cask "istat-menus"
cask "keepassxc"
cask "keka"
cask "obsidian"
cask "protonvpn"
cask "synology-drive"
cask "vlc"

# Developer apps
cask "datagrip"
cask"font-jetbrains-mono-nerd-font"
cask "github"
cask "ghostty"
cask "herd"
cask "jetbrains-toolbox"
cask "little-snitch"
cask "rider"
cask "sublime-text"
cask "transmit"
cask "unity"
cask "visual-studio-code"
cask "webstorm"
cask "yaak"

# Optional/personal apps
cask "ableton-live-suite"
cask "audio-hijack"
cask "bettertouchtool"
cask "blender"
cask "ilok-license-manager"
cask "midi-monitor"
cask "ogdesign-eagle"
cask "shottr"
cask "soulseek"
cask "transmission"
